def search_products_list():
    return {
        # Cereal Foods
        '곡물류': ['쌀', '밀', '보리', '옥수수', '퀴노아', '파스타', '빵', '면', '즉석밥'],

        # Fruit & Vegetable Products
        '과일_야채류': ['과일', '야채', '두부', '견과류'],

        # Meat & Meat Products
        '육류_육가공품': ['소고기', '돼지고기', '닭고기', '양고기', '계란', '햄', '소시지', '삼겹살', '치킨', '닭가슴살'],

        # Fish & Fishery Products
        '해산물류': ['생선', '해산물'],

        # Dairy Products
        '유제품류': ['우유', '치즈', '요구르트', '유제품'],

        # Fats & Oils
        '지방_기름류': ['기름', '버터'],

        # Sugars & Sweets
        '설탕_과자류': ['설탕', '사탕', '초콜릿', '과자', '마카롱'],

        # Beverages
        '음료류': ['음료', '커피', '차', '쥬스', '와인', '맥주', '청량음료'],

        # Meals & Fast Foods
        '식사류_패스트푸드': ['피자', '햄버거', '샌드위치', '라면', '패스트푸드', '간편식', '치킨', '피자', '햄버거', '짜장면', '파스타', '마라탕', '쌀국수'],

        # Korean Cuisine
        '한식류': ['한식', '밥', '국', '찌개', '전', '구이', '김치', '떡볶이', '족발', '갈비탕', '김치찌개', '순대국밥', '곱창전골', '냉면'],

        # International Cuisine
        '국제요리류': ['중식', '일식', '서양식', '동남아식', '인도식', '초밥', '탕수육', '양고기'],

        # Others
        '기타': ['간식', '스낵', '아이스크림', '케이크', '빵류', '푸드트럭', '만두', '샐러드', '요거트', '치즈', '카레', '초콜릿', '샌드위치']
    }


if __name__ == '__main__':
    a = search_products_list()
    total = 0
    for category, items in a.items():
        total += len(items)
    print(total)
