def search_products_list():
    return {
        # Cereal Foods
        '곡물류': ['쌀', '밀', '보리', '옥수수', '퀴노아', '파스타', '빵', '면', '즉석밥', '콩', '렌틸콩', '찹쌀', '보리쌀', '통밀', '수수', '옥수수', '통밀',
                '밀가루', '곡물', '씨앗', '코코넛', '아몬드', '치아씨드', '호밀', '팥'],

        # Fruit & Vegetable Products
        '과일_야채류': ['과일', '야채', '두부', '견과류', '시금치', '상추', '바나나', '사과', '포도', '오렌지', '딸기', '블루베리', '망고', '아보카도', '키위',
                   '토마토', '수박', '멜론', '체리', '자몽', '감', '파인애플', '오이', '당근', '브로콜리', '양파', '감자', '고구마'],

        # Meat & Meat Products
        '육류_육가공품': ['소고기', '돼지고기', '닭고기', '양고기', '계란', '햄', '소시지', '삼겹살', '치킨', '닭가슴살', '패티', '튀김', '스테이크', '바비큐',
                    '베이컨', '닭발', '목살', '등심', '안심', '불고기', '갈비', '비엔나소시지', '프랑크푸르터', '잡채', '돈가스'],

        # Fish & Fishery Products
        '해산물류': ['생선', '해산물', '조개', '새우', '문어', '오징어', '장어', '연어', '참치', '가자미', '게', '홍합', '낙지', '전복', '해파리', '멸치', '김',
                 '해삼', '꽃게', '갈치', '고등어', '굴'],

        # Dairy Products
        '유제품류': ['우유', '치즈', '요구르트', '유제품', '버터', '크림', '생크림', '마스카포네', '리코타', '모짜렐라', '파마산', '블루치즈', '고르곤졸라', '프로볼로네',
                 '까망베르', '산도비치', '슈레드치즈', '휘핑크림', '파르마산 치즈', '블루 치즈', '코티지 치즈', '엔페라또르 치즈', '리코타 치즈'],

        # Fats & Oils
        '지방_기름류': ['기름', '버터', '올리브유', '코코넛오일', '캐놀라유', '포도씨유', '들기름', '참기름', '쇼트닝', '랩시드유', '아보카도오일', '플랙시드오일',
                   '선방창유'],

        # Sugars & Sweets
        '설탕_과자류': ['설탕', '사탕', '초콜릿', '과자', '마카롱', '베이커리', '도넛', '젤리', '푸딩', '머핀', '컵케이크', '쿠키', '브라우니', '케이크', '파이',
                   '사탕수수', '꿀', '누가바', '프로틴바', '카라멜', '마쉬멜로우'],

        # Beverages
        '음료류': ['음료', '커피', '차', '쥬스', '와인', '맥주', '청량음료', '칵테일', '스무디', '에너지드링크', '우유', '탄산수', '소주', '막걸리', '사케',
                '포도주', '보드카', '위스키', '럼', '티', '에스프레소', '아메리카노'],

        # Meals & Fast Foods
        '식사류_패스트푸드': ['피자', '햄버거', '샌드위치', '라면', '패스트푸드', '간편식', '치킨', '짜장면', '파스타', '마라탕', '쌀국수', '타코', '비빔밥', '수프',
                      '도시락', '핫도그', '초밥', '떡볶이', '김밥', '돈까스', '튀김', '나초', '프렌치프라이', '새우튀김', '봉골레 파스타', '소보로빵'],

        # Korean Cuisine
        '한식류': ['한식', '밥', '국', '찌개', '전', '구이', '김치', '떡볶이', '족발', '갈비탕', '김치찌개', '순대국밥', '곱창전골', '냉면', '비빔밥', '된장찌개',
                '불고기', '삼계탕', '애호박볶음', '소불고기', '삼겹살', '해물파전', '두부김치', '순두부찌개', '계란말이', '비빔냉면', '잡채', '갈비찜', '김치전', '굴비',
                '생선구이', '낙지볶음', '감자탕'],

        # International Cuisine
        '국제요리류': ['중식', '일식', '서양식', '동남아식', '인도식', '초밥', '탕수육', '양고기', '스파게티', '라자냐', '카레', '팟타이', '피자', '멕시칸푸드',
                  '그릭푸드', '텐동', '라멘', '덮밥', '돈부리', '짬뽕', '핫도그', '치킨텐더', '칠리크랩', '빠에야', '랍스터', '치킨텐더', '파스타', '피자', '스시',
                  '크림스프', '비프스튜'],

        # Others
        '기타': ['간식', '스낵', '아이스크림', '케이크', '빵류', '푸드트럭', '만두', '샐러드', '요거트', '치즈', '카레', '초콜릿', '샌드위치', '컵라면',
               '식료품', '프로틴바', '야식', '핫케이크', '팬케이크', '와플', '토스트', '버거', '슈크림빵', '도넛', '카페라떼', '컵케이크', '롤케이크', '잼',
               '크루아상', '베이글', '머핀']
    }


if __name__ == '__main__':
    a = search_products_list()
    total = 0
    for category, items in a.items():
        total += len(items)
    print(total)
